ruby-rails/api-port/app/controllers/heros_controller.rb

SELECT `heros`.* FROM `heros` WHERE (name LIKE '%'t'%')
---
  def index
    @heros = Hero.all

INSERT INTO `heros` (`name`, `created_at`, `updated_at`) VALUES ('Ant Man', '2019-04-21 11:42:32', '2019-04-21 11:42:32')
---
  def create
    @hero = Hero.new(hero_params)

    if @hero.save

UPDATE `heros` SET `name` = 'Winter Soldier', `updated_at` = '2019-04-21 11:44:01' WHERE `heros`.`id` = 5
---
  def update
    if @hero.update(hero_params)

DELETE FROM `heros` WHERE `heros`.`id` = 4
---
  def destroy
    @hero.destroy

SELECT  `heros`.* FROM `heros` WHERE `heros`.`id` = 1 LIMIT 1
---
  def set_hero
    @hero = Hero.find(params[:id])